[{"title":"MissingNo.","content":"\n\tError: {$page.status} | Datapack Hub\nError {$page.status}: {$page.error.message}\n\nThere was an error when loading this page. Maybe it doesn't exist?\nIf you think this is an error, please report it in our Discord.","tags":[],"versions":"latest","url":"/+"},{"title":"Commands","content":"\nThis page is validated and up to date with Minecraft Java: 1.21\n\nCommands\nCommands are the basic building blocks of most datapacks. Each command is a simple instruction which can tell the game to do something. Most datapacks are made primarily of functions - functions are just lists of commands ran in order.\n\nCommand Syntax\nMost commands follow this basic syntax:\ncommand ...\ncommand would refer to the name of the command, and ... would be the arguments that come after the command, changing how it runs.\n\nMinecraft (and this wiki) use these for showing command syntax, to make it easier for you to understand:\n\nVariable | Meaning\n|---------\n `` | An argument.\n [entry] | An optional entry.\n [entryA│entryB│entryC] | Pick one of these. This is optional.\n (entryA│entryB│entryC) | Pick one of these. This is required\n ... | Some syntax is left out, you can find more about the command on its dedicated page","tags":[],"versions":"latest","url":"/wiki/commands/about/"},{"title":"Target Selectors","content":"\nThis page is validated and up to date with Minecraft Java: 1.21\n\nItem Components\nItem components are data structures which can be applied to items in Minecraft to give them special attributes, such as a name, lore, being able to be eaten, etc. Each item has specific item components by default - for example, all food items will have the minecraft:food component, which makes the item edible.\n\nA command such as /give or /item can be used to create an item which has additional item components, or remove item components from any item.","tags":[],"versions":"latest","url":"/wiki/commands/item_components/"},{"title":"Coordinates","content":"\nThis page is validated and up to date with Minecraft Java: 1.21\n\nCoordinates\nCoordinates in Minecraft are represented by an x, y, and z value. They are used to represent positions of entities, blocks, particles, sounds and more. In commands, they are represented as simply x y z, where x, y, and z are decimal numbers representing the coordinates on each axis.\n\nBlock coordinates are locked to the grid and are unique - there can only be one block per set of coordinates. Block coordinates are whole numbers, for example you can have a block at 123 86 94 but not 123.7 86.2 94.6. Entities are not locked to the grid - they can be at decimal positions (and usually are).\n\nx.0 y.0 z.0 represents the bottom left corner of a block, not the centre. The centre of a block would be represented by the coordinates x.5 y.5 z.5.\n\n:::info\nEvery command and function in Minecraft is always executed at a position. This is usually the world spawn. You can change this using the commands \"execute at\" or \"execute positioned\".:::\n\nExamples\n/setblock 123 86 94 minecraft:pink_concrete:\nIn this setblock command, we tell the game to put a pink concrete block at the coordinates 123 86 94.\n/tp @s 66.2 98 45.7:\nThis command would teleport the current entity to the exact coordinates 66.2 98 45.7\n\nRelative Coordinates\nUsing the symbols ~ and ^, we can reference coordinates relative to the current coordinates (for example, you can get the posiiton 7 blocks above the current position).\n\n represents the current position on any axis. For example, 12  76 would teleport me to x=12 z=76 but keep y as the current position. The coordinates   ~ would represent the position of the command - this is useful to do something at the current position such as placing a block or summoning an entity.\n\nThe  symbol can be followed by a number to include an offset to the current position. For example,  12  would represent the current postion offsetted by 10 blocks on the y-axis (or in simpler terms: the position 10 blocks above the current position). This can also be a negative number.\n\nSimilarly ^ represents a relative position, taking into account the current rotation too. The most common use for this is to get a position in front of the direction of rotation. For example, you can use ^ ^ ^5 to get the position 5 blocks in front of the current position in whatever direction the command or entity is rotated.","tags":[],"versions":"latest","url":"/wiki/commands/coordinates/"},{"title":"MissingNo.","content":"","tags":[],"versions":"latest","url":"/wiki/commands/namespaces/"},{"title":"Target Selectors","content":"\nThis page is validated and up to date with Minecraft Java: 1.21\n\nTarget Selectors\nTarget Selectors are used as an argument in commands to select entities and players in the world. We use target selectors to find players or mobs and do things to them. Many commands need to be given a target selector as an argument, or otherwise require being executed as an entity.\n\nAll target selectors start with an @ symbol, followed by a base selector (see the table below), and optionally any other criteria which will narrow down the selection further.\n\nExample: tellraw @a[distance=..10] \"You're within 10 blocks of me\". The target selector is @a[distance=..10], and tells the game to only send the message to players within 10 blocks.\n\nBase target selectors\nIn Java Edition, there are 6 base target selectors:\n\n| Target Selector | Description |\n|---|---|\n| @e | All Entities - By itself, this selector will select every single entity which is currently loaded in the world |\n| @s | This Entity - This selector will select the entity which is currently running the command. For example, if I run a command as @s, then it will run the commands as me. |\n| @a | All Players - This selects all currently online players. (All players are always loaded in the world). |\n| @r | Random Player - This selects one random player. |\n| @p | Nearest Player - This selects the nearest player to the position this command is ran from. |\n| @n | Nearest Entity - This selects the nearest entity (player or non-player) to the position this command is ran from. |\n\n:::warning\n@e only selects entities in a loaded chunk. If an entity exists but is not currently being loaded, it will not select that entity.:::\n\nAdditional arguments\nTarget selectors can (and usually are) followed by additional arguments to filter the selection even more to only find the entities that you want. Target selector arguments are contained within square brackets after the base selector (@e[...]) and are written as [:,=,...]\n\nExample: In our previous example (@a[distance=..10]), we use the argument distance=..10 to specify that we only want to target entities which are less than 10 blocks away.\n\n:::tip\nMost target selectors can be inverted by using =! meaning it will only select entities who do not match the argument. (E.g. @e[type=!minecraft:creeper] will select every entity that is NOT a creeper) :::\n\n| Argument | Example | Description |\n|--|--|--|\n| type | @e[type=minecraft:pig] | Filters to only include entities of a certain type or entity_type tag. Valid with @e, @s and @n. type can be any entity ID or entity_type tag. |\n| name | @e[name=Aron] | Filters to include entities with a specific name. name is a string - it cannot be JSON text. |\n| distance | @e[distance=6] | Filters to include entities within a certain distance or range. .. is used to represent \"greater/less than\" operations - for example, ..6 means less than 6 and, 8.. means more than 8. |\n| nbt | @a[nbt={SelectedItem:{id:\"minecraft:stone\"}}] | Filters to include entities with specific NBT data. NBT data will be partially matched - as long as the specified data exists on the entity, it doesn't matter what other data it has. |\n| sort and limit| @e[limit=1,sort=nearest] | These two arguments are often used together to find entities based on ordering. For example, limit=5,sort=furthest selects the 5 entities which are furthest away from the current position. |\n| x/y/z | @e[x=10,y=9,z=-5,distance=..5] | Specifies a starting position to work from; affecting distance, dx/dy/dz, and sort/limit. If left blank, it defaults to   ~. |\n| dx/dy/dz | @e[x=10,y=13,z=87,dx=10,dy=20,dz=5] | Creates a selection area (cuboid) which will only select entities if any of their hitbox is within the area. x/y/z is needed to specify the position of the bottom right corner of the cuboid - if it is left out it defaults to the current position. If all the dxyz values are 0 (or one is set to 0 and no others are set), then it will select any entities if the current position is inside their hitbox.|\n| tag | @a[tag=CustomTag] | Selects entities with a specified tag added with the /tag command or Tags[] NBT. No entities have tags by default - tags can only be added by the datapack or by commands. |\n| team | @a[team=red] | Selects entities in a specific team. |\n| scores | @e[scores={foo=10}] | Selects entities based on their value on a scoreboard. Like distance, you can use .. to specify ranges. |\n| predicate | @e[predicate=namespace:my_predicate] | Selects entites based on whether they pass a custom predicate check. |\n| gamemode | @a[gamemode=creative] | Selects players in a specific game mode. |\n| advancements | @a[advancements={minecraft:story/follow_ender_eye=true}] | Selects players based on whether they have unlocked a specific advancement. |\n| level | @a[level=10] | Selects players based on their current XP level (not amount of points). |\n\nMore information about the arguments:\n\ntype argument\nThe type= argument will filter the selection to only include entities of a certain type, or those in an entity_type tag.\n\n` must be a valid entity ID or entity_type tag ID. This argument can only be used with @e or @s`.\n\nExamples:\n@e[type=minecraft:pig]: Selects all pigs\n@e[type=#minecraft:aquatic]: Selects all aquatic animals\n\nname argument\nThe name= argument will filter the selection to only include entities who have a specific name.\n\n`` is a string (it cannot be a JSON text component).\n\nExamples:\n@e[name=Aron]: Selects all entities named Aron\n@e[name=\"Aron Aronson\"]: Selects entities named Aron Aaronson\n\ndistance argument\nThe distance= argument will filter the selection to only include entities who are within a distance range.\n\n` can either be a value (such as 7) or a range (such as ..8 or 21..`)\n\nExamples:\n@e[distance=6]: Selects all entities which are exactly 6 blocks away from the execution position.\n@e[distance=..20]: Selects all entities within 20 blocks of the execution position.\n@e[distance=3..]: Selects all entities that are more than 3 blocks away from the execution position.\n@e[distance=12..15]: Selects all entities between 12 and 15 (inclusive) blocks from the execution position.\n\nnbt argument\nThe nbt= argument will filter the selection to only include entities which have or do not have specific NBT data.\n\n`` is an NBT compound. The entity must match everything within the compound.\n\nExamples:\n@a[nbt={SelectedItem:{id:\"minecraft:stone\"}}]: Selects all players who are holding stone\n@e[type=minecraft:arrow,nbt={inGround:1b}]: Selects all arrow entities who are in a block.\n\nsort and limit arguments\nThe sort=,limit= will limit the amount of possible entities it will select and will select entities based on the priority defined in ``.\n\n`` can be one of the following:\narbitrary: does not sort in any guaranteed order\nnearest: sort in increasing order of distance\nfurthest: sort in decreasing order of distance\nrandom: sort randomly (default type for @r)\n\n`` can be any integer.\n\nExamples:\n@e[limit=1,sort=nearest]: Selects the nearest entity to the position of execution\n@e[limit=5,sort=furthest]: Selects the furthest 5 entities from the position of execution.\n@e[limit=7,sort=random,type=minecraft:cow]: Selects 7 random cows..\n\nx/y/z arguments\nThe x/y/z= arguments do not directly change the selection, but are used alongside other arguments to specify a starting position to work from.\n\nThis argument(s) will affect the arguments distance, dx/dy/dz and sort/limit.\n\nExamples:\n@e[x=10,y=9,z=-5,distance=..5]: Selects all entities less than 5 blocks away from the position X=10/Y=9/Z=-5\n\ndx/dy/dz arguments\nThe dx/dy/dz arguments will create a cuboid that is at least 1x1x1 blocks big and each value above 0 will increase the size of the cuboid in that direction by a full block.\n\nAny entity fully or partially inside the cuboid will be selected.\n\nYou can mix and match dx, dz, and dz however you want. To create the cuboid at least 1 of the three has to be there.\n\n:::info\nThe generated cuboid does not snap to the block grid:::\n:::info\nThe base cuboid that gets generated with dx/dz/dz=0 will always stretch from the command origin to positive x/y/z:::\n\nExamples:\n@e[x=10,y=13,z=87,dx=10,dy=20,dz=5]: Selects any entities if any part of their hitbox is within the cuboid w=10,h=20,l=5 starting from the position x=10,y=13,z-87\n@e[x=7,y=3,z=9,dx=0,dy=0,dz=0]: Selects any entities if their hitbox contains the point x=7,y=3,z=9\n\ntag argument\nThe tag= argument will select entities which have the specified tag. `` is any tag string (no spaces).\n\nEntities do not naturally have tags - these are separate from entity_type tags such as that used in the type argument. Instead, these select entities based on the tags added with the /tag command or Tags[] NBT.\n\nExamples:\n@a[tag=CustomTag]: Selects all players with the tag CustomTag\n@e[tag=!ignore]: Selects all entities which do not have the ignore tag.\n\nteam argument\nThe team= argument will select entities which are in a specific team. Since entities can only be in one team at a time, you cannot use team= more than once, however you can duplicate negated team arguments (team=!).\n\n`` is any tag string (no spaces).\n\nExamples:\n@a[team=red]: Selects all players in the red team\n@e[team=Bears]: Selects all entities in the Bears team\n@e[team=!blue]: Selects all entities which are not in the blue team\n\nscores argument\nThe scores={=,...} argument will select entities based on their value on a scoreboard.\n\n` is a scoreboard objective which must exist already. ` can be either an integer or a range.\n\nExamples:\n@e[scores={foo=10}]: Selects all entities with a score of exactly 10 on the foo scoreboard.\n@e[scores={foo=5,bar=7}]: Selects all entities with a score of exactly 5 on the foo scoreboard and exactly 7 on the bar scoreboard.\n@e[scores={foo=8..}]: Selects all entities with a score of 8 or more on the foo scoreboard.\n\npredicate argument\nThe predicate= argument will select entities based on whether they pass a predicate check. `` is a predicate ID.\n\nExamples:\n@e[predicate=namespace:my_predicate]: Selects all entities who pass the predicate in /data/namespace/predicates/my_predicate.- - @e[predicate=!namespace:another_predicate]: Selects all entities who fail the predicate in /data/namespace/predicates/another_predicate.json`\n\ngamemode argument\nThe gamemode=(survival|creative|adventure|spectator) argument will select players who are in a specific game mode.\n\nExamples:\n@a[gamemode=creative]: Selects all players in creative mode\n\nadvancements argument\nThe advancements={=(true/false)} argument will select players based on whether they've unlocked an advancement. `` is an advancement ID.\n\nExamples:\n@a[advancements={minecraft:story/follow_ender_eye=true}]: Selects all players who have unlocked the follow_ender_eye advancement.\n@a[advancements={minecraft:story/follow_ender_eye=false}]: Selects all players who have not unlocked the follow_ender_eye advancement.\n\nadvancements argument\nThe advancements={=(true/false)} argument will select players based on whether they've unlocked an advancement. `` is an advancement ID.\n\nExamples:\n@a[advancements={minecraft:story/follow_ender_eye=true}]: Selects all players who have unlocked the follow_ender_eye advancement.\n@a[advancements={minecraft:story/follow_ender_eye=false}]: Selects all players who have not unlocked the follow_ender_eye advancement.\n\nlevel argument\nThe level= argument selects players based on their current XP level (not amount of points).\n\n`` can be an integer or range.\n\nExamples:\n@a[level=10]: Selects all players who have an XP level of exactly 10.\n@a[level=4..]: Selects all players who have an XP level of 4 or more.\n\nTODO x_rotation and y_rotation\n","tags":[],"versions":"latest","url":"/wiki/commands/target_selectors/"},{"title":"/summon","content":"\n This page is up to date and validated for the Minecraft version: 1.21\n\n/summon command\nThe /summon command is used to summon an entity at a position, along with any entity NBT.\n\nSyntax\nThe syntax of the /summon command is as follows:\nsummon  [position] [nbt data]\n`: an ID of a minecraft entity. For example: minecraft:cow, marker, zombie. If the namespace (minecraft:) is omitted, it will default to the minecraft` namespace.\n[position] (optional): the coordinates at which the entity should be spawned. (Defaults to the current position).\n[nbt data] (optional): a compound containing the NBT (in SNBT format) which the entity should be spawned with. For example: {NoAI:1b}.\n\nExamples\nsummon minecraft:cow - Summons a cow at the current position.\nsummon minecraft:ender_dragon  50 ~ - Summons an ender dragon 50 blocks above the current position\nsummon minecraft:wither 29 372 121 - Summons a wither at the coordinates x=29, y=372, z=121\nsummon minecraft:zombie   ~ {NoAI:1b} - Summons a zombie at the current position with the NoAI NBT, meaning it will not move around or attack players.\n\nAlternatives\nThe execute summon  command can also be used to summon an entity. Using this execute subcommand will summon an entity at the current position, and then run the specified command as the newly summoned entity.\n\nHowever, execute summon cannot provide any NBT to give the entity upon being spawned. You will have to edit the nbt in the command/function which is executed, which can be a bit tedious. An alternative to execute summon minecraft:cow run function custom_function would be the following:\nsummon minecraft:cow   ~ {Tags:[\"newly_summoned_cow\"]}\nexecute as @n[type=cow,tag=newly_summoned_cow] at @s run function custom_function\ntag @n[type=cow,tag=newly_summoned_cow] remove newly_summoned_cow\n`","tags":[],"versions":"latest","url":"/wiki/command/summon/"},{"title":"Getting Started","content":"\nThis page is validated and up to date with Minecraft Java: 1.21\n\nSyntax\n\nVariable | Meaning\n|---------\n `` | An argument.\n [entry] | An optional entry.\n [entryA│entryB│entryC] | Pick one of these. This is optional.\n (entryA│entryB│entryC) | Pick one of these. This is required\n ... | Some syntax is left out, you can find more about the command on its dedicated page\n\nList of all commands\nPermission level 2+\nThese commands require a permission level same or bigger than 2 to run them.\n/advancement grant|revoke  everything|only|from|through|until (|) - Gives, removes or checks player advancements\n/attribute   get|base|modifier ... - Can change or read attributes\n/bossbar list|add|remove|set|get [] ... - Changes and creates bossbars\n/clear [] [] [] - Clears items from the players inventory\n/clone   ... OR /clone from    ... - Copies blocks in an area from one place to another\n/damage   [] [at ]|[by ] [from ] - Damages selected entities\n/data get|merge|modify|remove ... - Changes block entity or entity NBT data (See more here: /data)\n   Data get: `/data get (block |entity |storage ) [","tags":[],"versions":"latest","url":"/wiki/command/all/"},{"title":"/execute","content":"\n This page is up to date and validated for the Minecraft version: 1.20.6\n\n/execute command\nThe execute command is used to execute other commands conditionally, or in a different context. The execute command is made up of multiple subcommands, which can be chained repeatedly and in any order to modify context in various ways.\n\nEach subcommand has its own syntax, and most allow/require another subcommand to follow.\n\nContext\nEvery command is executed in a context. Various execute subcommands can modify the context in which other commands are run.\nThe context includes:\nPosition: The position at which the command is executed (the origin of relative coordinates)\nAnchor: Either eyes or feet. Specifies the origin of local coordinates to either the eyes or feet of an entity.\nExecutor: The entity executing the command (which entity the @s selector refers to)\nRotation: The rotation of the command\nDimension: The dimension in which the command is executed\n\nForking\nSome commands cause a fork. That is, the following chain of subcommands get executed more than once. When a command is forked, it executes the fork as a whole, then proceeds to the next fork.\n\nFor example, if there are two markers A and B, and the following command is run: execute as @e[type=marker] run function example\nAnd the example function contained the following commands:\n\nsay first command\nsay second command\n\nThe chat output would look like this:\n\n[A] first command\n[A] second command\n[B] first command\n[B] second command\n\nSubcommands\n:::info\nIn this documentation, ... represents another required subcommand, and [...] denotes that another subcommand is optional.\n:::\n\nexecute align  ...\nThe align  subcommand aligns the executing position to the specified axes (rounding down coordinates to integers). ` can be any subset of xyz`, in any order.\n\nExamples:\nexecute align xz ...\nexecute align yxz ...\n\nexecute anchored (eyes|feet) ...\nChanges the execution anchor to the eyes or feet of the entity.\n\nExamples:\nexecute anchored eyes ...\n\n:::warning\nWhen the position is changed not relative to the player, it resets back to feet. You can lock this though by using positioned ^ ^ ^ after it.\n:::\n\nexecute as  ...\nChanges the executor of the following subcommand to `` (Does not modify any other context such as location).\nIf `` refers to multiple entities, the following subcommand gets executed once for each referenced entity, with that entity as the executor.\nIf `` refers to no entities, the execute chain terminates and no further subcommands are run.\n\nExamples:\nexecute as @a[distance=10..] ...\nexecute as @e[type=pig] ...\n\nexecute at  ...\nChanges the position and rotation of the following subcommand to that of `` (Executor remains the same).\nForking rules apply the same as execute as.\n\nExamples:\nexecute at @s ...\nexecute at @p ...\n\nexecute facing  ...\nChanges the rotation of the following subcommand to face ``.\n` can either be a set of coordinates, or entity  (eyes|feet)`, which targets the eyes or feet of the given entity.\n\nExamples:\nexecute facing 0 0 0 ...\nexecute facing entity @e[type=marker,limit=1] feet\n\nexecute in  ...\nChanges the dimension of the following subcommand to ``.\nApplies dimension scaling, meaning coordinates are divided by 8 when transferring from the overworld to the nether.\n\nExamples\nexecute in minecraft:nether ...\n\nexecute on  ...\nChanges executor to other entities based on their relation with the current executor. Same forking rules apply as execute as.\nPossible values for `` are:\nattacker - The most recent entity to damage the current entity in the last 5 seconds.\ncontroller - The entity which is riding and in control of the current entity.\nleasher - The entity holding the the current entity on a lead.\norigin - The entity the current entity originated from, such as the player that shot an arrow.\npassengers - All entities riding the current entity (not including entities riding the passengers).\ntarget - The entity the current entity is trying to attack (angry at).\nvehicle - The entity that the current entity is riding.\n\nExamples\nexecute on passengers ...\nexecute on target ...\n\nexecute positioned  ...\nChanges the position (but not rotation) of the following subcommand to ``. Also resets anchor.\n` can be a set of coordinates, as , or over `.\npositioned as  ... is equivalent to at  ..., except that it doesn't change rotation or dimension.\npositioned over  sets the y coordinate of the position to be one above the specified heightmap.\n\nExamples:\nexecute position  0 -10 ...\nexecute positioned as @s ...\nexecute over world_surface ...\n\nexecute rotated  ...\nChanges the rotation of the following subcommand to ``.\n` can either be rotation coordinates, or as , which changes the rotation to that of the specified entity. For rotated as , forking rules apply the same as as entity`.\n\nExamples:\nexecute rotated ~10 0 ...\nexecute rotated as @e[tag=rotate] ...\n\nexecute summon  ...\nSummons the specified entity at the current position, and executes the following subcommand as that entity.\nNote: You cannot specify NBT data for the summoned entity.\n\nExamples:\nexecute summon iron_golem ...\nexecute summon marker ...\n\nexecute run \nRuns the specified command with the current context. Takes no further subcommands.\n:::info\nThis is useless by itself, and should always be preceded by other subcommands.\n:::\n\nExamples:\nexecute run say hi\nexecute at @e[type=sheep] run setblock   ~ stone\n\nexecute store (result|success)  ...\nStores an integer value somewhere. If storing result, this numeric value is taken from the output of the final subcommand (Either a run subcommand or a condition). If storing success, the value is either 1 if the final subcommand succeeds (condition passes or command successfully performs its function), or 0 otherwise.\n\ntarget can be one of the following:\n`block","tags":[],"versions":"latest","url":"/wiki/command/execute/"},{"title":"/function","content":"\n This page is up to date and validated for the Minecraft version: 1.21\n\n/function command\nThis command runs any .mcfunction file when called. You can also pass in a NBT compound or NBT source path if the function is a macro function. All functions are run independently and one after another - for example, if you run function1 and then function2, then function2 will only run once function1 has finished.\n\nSyntax\nfunction :**: Runs the .mcfunction file at data//function/\nfunction : {key:value}**: Runs the .mcfunction file at data//function/, and uses the {key:value} if the function is a macro function.\n`function : with (block |entity |storage )","tags":[],"versions":"latest","url":"/wiki/command/function/"},{"title":"Tags","content":"\nThis page is validated and up to date with Minecraft Java: 1.21\n\nTags\nRegistry tags, not to be confused with entity tags, are essentially lists of groups such as blocks, items, entity types, etc. They use JSON format and are located in the data//tags/ folder.\n\nSpecial tags\nMinecraft uses some tags internally for certain behaviours. These tags are located in the minecraft namespace. For example:\nany functions in the #minecraft:load function tag will be automatically run when a datapack is loaded\nthe #minecraft:minable/pickaxe block tag lists blocks which are mined faster using a pickaxe.\n\nIn many cases, modifying these special tags allows you to configure certain aspects of how Minecraft behaves.\n\nRegistries\nTags group various types in a specific registry (category).\n\nThis list shows all of the possible registry types, as well as the path their tags should be put in.\nItems (/tags/item)\nBlocks (/tags/block)\nEntity types (/tags/entity_type)\nFunctions (/tags/function)\nFluids (/tags/fluid)\nGame Events (/tags/game_event)\nChat Types (/tags/chat_type)\nDamage Types (/tags/damage_type)\nBanner patterns (/tags/banner_pattern)\nCat variants (/tags/cat_variant)\nEnchantments (/tags/enchantment)\nGoat horns (/tags/instrument)\nPaintings (/tags/painting_variant)\nEntity POI (/tags/point_of_interest_type)\nBiome (/tags/worldgen/biome)\nFlat world preset (/tags/worldgen/flat_level_generator_preset)\nStructures (/tags/worldgen/structure)\nWorld preset (/tags/worldgen/world_preset)\n\nJSON format\nTags have a very simple format, with two fields.\n\nreplace\nreplace is a boolean field which decides whether the tag should replace other tags with the same path, or merge with them. For example, if \"replace\": true is added to the tick.json function tag, only the tick functions in that datapack would load, as it would replace all other defined tick tags. If replace is false, it will merge with any values in tick.json within other packs.\nreplace is an optional field, and if not specified will default to false.\n\nvalues\nValues (values) is an array containing everything to group under this tag. Each element is either a string or an object containing an id field and a required field (object example {\"required\": false, \"id\":\"minecraft:stick\"} ). The plain string and the id field contain either the ID of the entry (such as minecraft:diamond_block), or the ID of another tag, beginning with a # (such as #minecraft:logs). The required field in the object is a boolean (true or false) which defines if this entry can be ignored if the id cannot be found.\n\nExample\nHere is an example tag, located in data//tags/item/wood.json.\n:::info\n#minecraft:logs and #minecraft:planks are two item tags provided by Minecraft.\n:::\n\n{\n  \"replace\": true,\n  \"values\": [\n    \"#minecraft:logs\",\n    \"#minecraft:planks\",\n    \"minecraft:chest\",\n    \"minecraft:stick\"\n  ]\n}\n","tags":[],"versions":"latest","url":"/wiki/files/tags/"},{"title":"Functions","content":"\nThis page is validated and up to date with Minecraft Java: 1.21\n\nFunctions\nFunctions are files essentially containing a list of Minecraft commands. Function files end in .mcfunction, and are located in the data//function folder. Functions can be called (ran) using the function command. (See /function for more information)\n\nThe function folder can contain sub-folders for organisation. This changes their reference accordingly - for example, a function located at data//function/sub_folder/my_func.mcfunction would be called using function :sub_folder/my_func.\n\nWhen a function is run, the commands within it are executed in order. If the return command is run, the function stops executing immediately and any commands after the return are ignored.\n\nAny line in a function which starts with a # is a comment, and the game ignores it. Any other line is interpreted as a command\n\nExample\nThis function will give every player an apple, then tell them to enjoy the apple.\nGive a player the apple\ngive @a minecraft:apple\n\nTell them to enjoy the apple\nsay Enjoy the apple!\n\nMacro functions\nMacros can dynamically change part of a function by inserting NBT into it. Any function can define a macro within it. A macro is a command beginning with $. Macros can use a special syntax: $(). This will substitute for any value provided as `` when run.\n\nThe /function command can specify a NBT compound to use as the macro values. In traditional programming, this is best represented as someFunction(foo, bar)\n\nExample\nIn this example, we write a function that gives the player a number of diamonds using a macro.\ndata/example/function/macro.mcfunction\n\nWhen called, $(count) will be replaced with some number, producing a valid command\n$give @s diamond $(count)\n\ndata/example/function/give.mcfunction\nfunction example:macro {count: 7}\n\nThis also works\ndata modify storage example:storage count set value 12\nfunction example:macro with storage example:storage\n","tags":[],"versions":"latest","url":"/wiki/files/functions/"},{"title":"SNBT Format","content":"\nSNBT Format\nSNBT (Stringified Named Binary Tags) format is a JSON-like tree structure used in datapack development to manipulate the NBT data of an entity. SNBT is a human-readable version of NBT (Named Binary Tags), which is a format used by Minecraft to store data. NBT is used to store data about entities, items, blocks, structures, game saves, and more.\n\nSNBT consists of key/value pairs, which are represented as key:value. These are contained with compounds, marked with curly brackets ({}). Compounds can contain multiple key/value pairs, which are separated with commas, like so: key:value,key:value,key:value\n\nAn example SNBT structure looks like: {name:\"Silabear\",age:102,friends:[\"Flynecraft\",\"Aandeel\",\"Cobblestone\"],socials:{discord:\"silabear\",twitch:\"silabearr\"}}\n\nData Types\nSNBT has a few data types you can use to represent different types of data, including whole numbers, decimal numbers, string, text, booleans, and more.\n\nStrings\nStrings can store any text value, or more technically, any sequence of unicode characters.\n\nFormat: Strings are stored within either double or single quotes. For strings containing standard characters (A-Z, a-z, 0-9, -,_,+,.), the quotes are optional, but recommended. `\"","tags":[],"versions":"latest","url":"/wiki/nbt/snbt/"},{"title":"Right Click Detection Summary","content":"\nThis page is validated and up to date with Minecraft Java: 1.21\n\nRight Click Detection Summary\n\nIf you alredy know which right click detection technique you are goin to use, you can get more information about them on their dedicated pages:\n\nUsing a Carrot on a stick/WFOAS\nUsing a Food Component\nUsing an Eye of Ender\nClicking an Interaction Entity\n\nPros and Cons of each method\n\n|Method | Pros | Cons | Difficulty to make | X clicks/second | Player/Location |\n|---|---|---|---|---|---|\n| COAS/WFOAS |  | Attracks pigs/striders when held, requires a command that runs every tick | Easy | Detects up to 5 clicks/second when holding right click | Bound to player, not location |\n| Food Component | Can detect clicks from any item,  | Only works 1.20.5+, slows player down when holding right click | Medium | Detects up to 20 clicks/second when holding right click | Bound to player, not location | Bound to player, not location |\n| Eye Of Ender |  | Slows player down when holding right click, only works in worlds without stronghold | Medium | Detects up to 20 clicks/second when holding right click | Bound to player, not location |\n| Interaction Entity | Also detects left clicks, an entity | Players can't break/hit/place through, requires an entity | Medium | detects up to 5 clicks/second when holding right click | Bound to location, not a player |\n\nAditional Info\nCOAS/WFOAS - This method works by using an item.used scoreboard objective which triggers when using either of the two items and then running commands as/at players with a score of 1 or higher.\nFood Component - This method works by using an item with a very long eating time which will never finish, in combination with an advancement to detect when you begin eating it.\nEye Of Ender - This method works by using an advancement to detect whenever a player uses an eye of ender and then executing code as/at them.\nInteraction Entity - This method works by using an advancement to check whether a player interacted with an interaction entity and then executing code.","tags":[],"versions":"latest","url":"/guide/right-click/"},{"title":"Using an Interaction Entity for RC detection","content":"\nThis page is validated and up to date with Minecraft Java: 1.21\n\nPros and cons\nPros:\nCan also detect left clicks\nWorks in any world\nDoesn't need to run every tick\nDoesn't attract mob\n\nCons:\nOnly works in 1.19.4+\nSlows player down when holding right click\nRequires an additional entity\nCan't be interacted through (e.g. can't build,attack,... throught it)\n\nOther:\nDetects up to 5 clicks/second when holding right click\nBound to a specific location, not player\n\nUsing an Interaction Entity for Right Click Detection\n\nFirstly we will need to create an advancement, located in data//advancement/. You can call it hovewer you want, but for the purpose of this guide we will call it interacted_with_interaction.json. This advancement is used to detect when a player clicks on an interaction entity.\n\n:::tip\nIf you don't want to detect a click on every interaction, you can detect it on only some by checking their NBT data, and using Tags to differentiate them.:::\n\n&gt; interacted_with_interaction.json\n{\n  \"criteria\": {\n    \"requirement\": {\n      \"trigger\": \"minecraft:player_interacted_with_entity\",\n      \"conditions\": {\n        \"entity\": {\n          \"type\": \"minecraft:interaction\"\n        }\n      }\n    }\n  },\n  \"rewards\": {\n    \"function\": \":rightclick_run\"\n  }\n}\n\nThen just create a simple function in data//function/, and call it the same as you did in the advancement, for us that would be rightclick_run.mcfunction\n\n&gt; rightclick_run.mcfunction\nRevoke the advancement so we can detect the click again\nadvancement revoke @s only namespace:interacted_with_interaction\nAnnounce that the player clicked on the interaction in chat, feel free to replace this with whatever you want it to do\nyour logic here...\nsay Used interaction\n\nNow you can summon the interaction entity by doing /summon interaction   ~ {width:2f,height:3f}.\n\nThat's it, you should now have working right click detection using an interaction entity.","tags":[],"versions":"latest","url":"/guide/right-click/interaction/"},{"title":"Using COAS/WFOAS for RC detection","content":"\nThis page is validated and up to date with Minecraft Java: 1.21\n\nDetecting right clicks: carrot on a stick\nUsing a carrot on a stick (or a warped fungus on a stick) is perhaps one of the simplest methods of right-click detection, requiring only a single tick command and a scoreboard. This method works due to the used:carrot_on_a_stick statistic detecting right clicks on any carrot_on_a_stick item.\n\n:::info\nFor the sake of simplicity, we will use a carrot on a stick, shortened to COAS. This method also works with warped fungus on a stick (WFOAS) items.\n:::\n\nCOAS and WFOAS items have a unique property that means that right clicking the item counts as \"using\" an item, and will therefore increase the used:carrot_on_a_stick statistic. We can track changes to this statistic using a scoreboard. When it goes up, we know that the player has right clicked a COAS, and we can run a command when that happens.\n\nMethod\nTo get started, we need to create a scoreboard with the criteria item.used:minecraft.carrot_on_a_stick, so that we can later detect when a player uses the COAS (by right clicking on it).\n\nIf you don't already have it, you'll need to create a load function with a command that creates a new scoreboard objective. You can name the objective whatever you want. We reccomend naming it something like .rc_coas. In your load function, put a scoreboard command such as this:\n\nscoreboard objectives add .rc_coas minecraft.used:minecraft.carrot_on_a_stick\n\nThis scoreboard will go up by 1 every time a player right clicks a COAS - when this happens we can execute our function. Note that this command must run every tick, otherwise it won't be able to detect right clicking. Put this in your tick/loop function:\n\nThis will run the \"rightclick_run\" function as the player who uses the COAS.\nexecute as @a[scores={.rc_coas=1..}] run function :rightclick_run\nscoreboard players reset @a[scores={.rc_coas=1..}] .rc_coas\n\nIn the rightclick_run.mcfunction file, you can do whatever you like as a result of right clicking the COAS. As an example, putting this in rightclick_run.mcfunction will make the player say Used COAS when they right click a COAS item.\n\nsay Used COAS\n\n:::note\nAdd another subheading for detecting clicks on a specific item with NBT, explaining how to check the currently held item.\n:::","tags":[],"versions":"latest","url":"/guide/right-click/coas/"},{"title":"Using the Food Component for RC detection","content":"\r\nThis page is validated and up to date with Minecraft Java: 1.21\n\nPros and cons\nPros:\nCan detect clicks from any item\nWorks in any world\nDoesn't require additional entities\nDoesn't need to run every tick\nDoesn't attract mobs\n\nCons:\nOnly works in 1.20.5+\nSlows player down when holding right click\n\nOther:\nDetects up to 20 clicks/second when holding right click\nBound to the player, not a specific location\n\nUsing the Food Component for Right Click Detection\n\nUsing the food component for right-click detection is one of the most flexible methods, simply because you can put it on (almost) ANY item. This method is not limited to a single item, like using a coas. You can use any item you want.\n\nThis is just a guide, so you'll need to change a few things for your actual datapack:\nChange `` to the item you want to detect\nChange `` to your namespace\nChange `` to whatever custom data you want\n\n:::warning\nYou can use any item for method, but if the item alredy has an existing right-click functionality (like placing a block), it will keep that.:::\n\nThe first step will be creating the advancement that detects when a player is \"using\" (in this case eating) the item, the name can be whatever you want ending in json, but for the purpose of this tutorial we will call it click_food.json. Then put this file into data//advancement/\n\n&gt; click_food.json\n{\n  \"criteria\": {\n    \"requirement\": {\n      \"trigger\": \"minecraft:using_item\",\n      \"conditions\": {\n        \"item\": {\n          \"items\": [\n            \"minecraft:\"\n          ],\n          \"predicates\": {\n            \"minecraft:custom_data\": {\"\": true}\n          }\n        }\n      }\n    }\n  },\n  \"rewards\": {\n    \"function\": \":rightclick_run\"\n  }\n}\n\nAs you can see, the advancement runs a function when it detects a player eating our custom item, so the next step is creating the actual function logic. This is pretty simple, just create a .mcfunction file in data//function/. Make sure you call the function the same, as you did in the advancement file, in our case rightclick_run.mcfunction\n\nYou can put whatever commands you want into this function, but make sure you revoke the advancement from the player, so the item can be clicked again.\n\n&gt; rightclick_run.mcfunction\nRevoke the advancement from the player so it can be used again\nadvancement revoke @s only :click_food\nAnnounce the use of the item in chat, feel free to replace this with whatever\nyour logic here...\nsay I successfully used food component detection!\n\nSee it in action!\nAfter /reloading the datapack, we will now need to give ourselfs the actual item with the custom food component. (You can run this in the chat to test it, or put it in a function to trigger when you want):\ngive @s stick[minecraft:food={nutrition:0, saturation:0, can_always_eat:true, eat_seconds:999999999}, minecraft:custom_data={:true}]\n\nHow it works\nWe've added a food component to our custom stick item, allowing it to be consumed like food. The player won't actually eat it, since eat_seconds is set to 999999999, so it would take them over 30 years. The food component lets the player try to eat it, which can be detected using an advancement. That advancement runs a function which removes the advancement so it can be triggered again next tick, and runs whatever code you want to the item to trigger.","tags":[],"versions":"latest","url":"/guide/right-click/food_component/"},{"title":"Using an Eye of Ender for RC detection","content":"\nThis page is validated and up to date with Minecraft Java: 1.21\n\nPros and cons\nPros:\nDoesn't require additional entities\nDoesn't need to run every tick\nDoesn't attract mobs\n\nCons:\nOnly works in worlds without strongholds\nSlows player down when holding right click\n\nOther:\nDetects up to 20 clicks/second when holding right click\nBound to the player, not a specific location\n\nUsing an Eye of Ender for Right Click Detection\n\n:::warning\nThis only works in world without strongholds, if you don't want that, you can either use a similiar method that works everywhere (using the Food Component method) or do some chnages to these functions, as specified at the end of this guide.:::\n\nThis is just a guide, so you'll need to change a few things for your actual datapack:\nChange `` to your namespace\nChange `` to whatever custom data you want\n\nUsing an Eye of Ender is a very similiar method to using the Food Component, with the difference that this can only be used in worlds without strongholds. With that out of the way, the first file we will need to create will be an advancement. Located in data//advancement/, we will need to create a .json file, we are going to call it used_eye_of_ender.json for the rest of he guide.\n\n&gt; used_eye_of_ender.json\n{\n  \"criteria\": {\n    \"requirement\": {\n      \"trigger\": \"minecraft:using_item\",\n      \"conditions\": {\n        \"item\": {\n          \"items\": [\n            \"minecraft:ender_eye\"\n          ],\n          \"predicates\": {\n            \"minecraft:custom_data\": {\"\": true}\n        }\n      }\n    }\n  },\n  \"rewards\": {\n    \"function\": \":rightclick_run\"\n  }\n}\n\nNow that we have the advancement, we can detect if the player is holding right click and call our function, that is located in data//function/. You will have to call this function the same name as you did in the advancement, for us that is rightclick_run.mcfunction.\n\nrightclick_run.mcfunction\n\nRevoke the advancement from the player so it can be used again\nadvancement revoke @s only :used_eye_of_ender\nAnnounce the use of the item in chat, feel free to replace this with whatever\nyour logic here...\nsay I successfully used EoE detection!\n\nIf you want this method to work in worlds with strongholds, you can either block the target of ender eyes in the pack.mcmeta or killing the eye and giving it back after it being used.","tags":[],"versions":"latest","url":"/guide/right-click/eoe/"},{"title":"Getting Started","content":"\nThis page is validated and up to date with Minecraft Java: 1.21\n\nGetting Started\nIf you're new to datapacks, you're at the right place. Looking around, getting into datapack creation might seem confusing, but once you've grasped the basics, you'll be off to a good start!\n\n:::info\nIf you don't know what datapacks are, then take this explanation. Datapacks are essentially add-ons to Minecraft which can change the game, whether by adding a simple game mechanic, or creating completely new experiences! The best part is that they're really easy to create, even if you have little coding knowledge:::\n\nThis guide will help you to create your first datapack, whether you've never tried coding before or if you've got loads of experience. The process of coding a datapack is a bit different to other typical programs. By the end of this tutorial, you'll have made a simple datapack which makes arrows explode when they land!\n\nGetting Started - Setting up an empty datapack\n\n\nThe first step when creating a datapack is to make a new world to test it in. Go ahead and do that now - make sure that your world has cheats enabled and it is set to creative mode. Once you've created the world, the next step is to find and open your world folder:\nSave and quit your world\nGo to your world in the Singleplayer menu and hit \"Edit\"\nPress \"Open World Folder\"\n\nThis folder opens contains all the data in your Minecraft world. You should see that there's lots of other subfolders in this folder. Find the one which is called datapacks, and open it.\n\nThis folder is where the world's datapacks are stored. Create a folder - this will be the root folder of your datapack project. The name doesn't matter. I'm just going to call it Example Datapack. Open this new folder. Inside this folder is where all the data starts from.\n\n:::tip\nBefore we go further, if you have downloaded and installed Visual Studio Code and the relevant extensions, then you should be able to right click inside the new folder that you created and \"Open in Code\". If not, then no worries, it isn't required.:::\n\nThe first file we want to create is the pack.mcmeta file. This file will tell Minecraft that the folder is a datapack, as well as holding the basic information of the pack. Create pack.mcmeta, and put this inside it:\n{\n    \"pack\":{\n        \"description\":\"DATAPACK NAME HERE\",\n        \"pack_format\":48\n    }\n}\nIf you're interested, here's what this file means:\npack is an object containing the metadata of the file.\n  description is the name of your datapack, usually along with a short description of what your pack does.\n  pack_format tells Minecraft what versions this datapack works in. 48 is the latest for 1.21\n\nWriting your first function\n:::info\nWhat are functions? In short, functions are the majority of what makes up most datapacks. A function is a file containing Minecraft commands. When a function is ran, every command in the function is ran in order. Functions are always ran as an entity (or as the Server) and at a position:::\nLet's get started by writing one simple function. In traditional programming function, let's make a function to show you \"Hello World\" when it is ran.\n\nCreate a folder in your datapack called data.\nIn the data folder, create a new folder.\nThis folder is your namespace - it will contain all the data specific to your datapack. Usually this needs to have a unique name (one which other people would not have picked), but for this tutorial just call it example.\nIn the example folder, create a folder called function. This folder will contain all the mcfunction files.\n\nYou should now have a folder structure that looks something like this:\n/world/datapacks/Example Datapack/data/example/function\n:::warning\nIn versions earlier than 1.21, the function folder should be called functions, due to some pesky name changes Mojang introduced in a recent update.:::\n\nOnce you're sure that's correct, you can start writing the actual function.\n\nIn the function folder, create an empty file called hello_world.mcfunction. Open this file with any text editor (we reccomend Visual Studio Code)\n\nInside hello_world.mcfunction, put the following:\nShow the player Hello World on their screen\ntitle @s title \"Hello World!\"\n\nGive the player a diamond\ngive @s diamond\nIt's that simple! Once you save that file, rejoin your world and then run /reload, you should be able to use the following command to run the function:\n/function example:hello_world\n\nWhat's next?\nNow you know how to create a basic function and run it, we'll next start to think about how to create our project. For more advanced projects, this can sometimes be the most difficult part. Luckily for us, what we want to create won't be too difficult.\n\nLet's break down the idea into smaller steps. Remember, we want to create a datapack which makes arrows explode.\n\nDetect when an arrow lands on the ground. We can do this by running a command on a loop which will select any arrow on the ground and then run a function.\nCreate an explosion. This is as simple as summoning a TNT at the position of the arrow.\nRemove the arrow. If you don't do this, then it will keep on exploding forever.\n\nThe next steps of this guide will guide you through the typical process of each of those steps.\n\nRunning functions on a loop\nThe first step on our list is to detect arrows which land on the ground. To do this, we need to run a command on a loop. Luckily, Minecraft makes this pretty easy for us.\n\nFirstly, let's make the function which you want to run on a loop. In the function folder, create a new mcfunction file - call this one loop.mcfunction.\n\nFor now, let's just make it say \"Hi\" every time it loops. You can do this by putting this in the new function:\nsay Hi\n\nTo make this function run on a loop, we need to create a JSON file which tells Minecraft \"run this command every tick\" (every tick = 20 times per second)\n\nIn the data folder, create the minecraft folder.\nIn the minecraft folder, create a tags folder\nIn the tags folder, create a function folder\nIn the new function folder, create a new file: tick.json\n\ntick.json is NOT a function. In tick.json, we are going to put a list of functions which we want to run every tick. If you put any commands in tick.json, it will break your pack.\n\nIn tick.json, put the following:\n{\n    \"values\":[\n        \"example:loop\"\n    ]\n}\nvalues is a list of function references which will be run on a loop.\nexample:loop is a reference to the loop.mcfunction file we created earlier. example refers to the namespace (the folder in data), and loop refers to the mcfunction file name.\n\nIf you save this file, go back to your world, and run /reload, you should see that the chat is being spammed with \"Hi\" over and over again!\n\nSelecting the arrows\nNow we've created a function which will run infinitely on a loop, we can move on to detecting when an arrow is in the ground.\n\nAs far as the game is concerned, an arrow is an enity, just like a pig, cow or zombie. Minecraft gives us a special way to select any types of entities with target selectors. Once we've selected an entity, we can use the /execute command to run a command as the entity.\n\nWe can use these to select all arrows which are in the ground, and then run a command to make them explode (and then remove themselves).\n\nAs mentioned, to select an entity, we need to use a target selectors. I'm going to teach you a bit about target selectors. You should pay attention here, but if you only want the code, scroll past this section.\n\nWhat are target selectors?\nTarget selectors are a special bit of code we can use to find an entity in the world. They all start with an @ symbol. There are 6 base target selectors:\n\n| Target Selector | Description |\n|---|---|\n| @e | All Entities - By itself, this selector will select every single entity which is currently loaded in the world |\n| @s | This Entity - This selector will select the entity which is currently running the command. For example, if I run a command as @s, then it will run the commands as me. |\n| @a | All Players - This selects all currently online players. (All players are always loaded in the world). |\n| @r | Random Player - This selects one random player. |\n| @p | Nearest Player - This selects the nearest player to the position this command is ran from. |\n| @n | Nearest Entity - This selects the nearest entity (player or non-player) to the position this command is ran from. |\n\nOn it's own, a base target selector (like in the table) does not do much. We can narrow down the selection even more by using criteria. Criteria are put in square brackets after the base selector.\n\nFor example, we can use @e with a type criteria to select all entities of a certain type - for example, @e[type=minecraft:cow] would select all cow entities.\n\nI'm not going to explain every single criteria you can use - you can view a list here. These are the basic ones which you might see quite often:\n\n| Criteria | Description |\n|---|---|\n| [type=minecraft:arrow] | Entity Type - This criteria will narrow down the selection to only include entities of a certain type. For good pack optimisation, you should use this often. |\n| [distance=..5] | Distance to entity - This criteria will only include entities based on their distance to their distance to the current position. .. can be used to represent a greater/less than symbol - for example, ..5 means less than 5 blocks away. |\n| [limit=2] | Limit selection - Using the limit criteria, you can make specify a max amount of entities to be selected. This is often used in conjunction with the sort criteria. For example, @e[sort=nearest,limit=1] would select the nearest entity of any type. |\n| [nbt={key:value}] | Entity Data - This criteria will select entities if their NBT (entity data) matches a pattern. |\n\nHow are we going to use them?\nWe can use these selectors to only select arrows which are in the ground. We can select all arrows with @e[type=arrow], but this will also include arrows in the air. To select arrows in the ground, we can check if they have the data {inGround:1b}, so we would use @e[type=arrow,nbt={inGround:1b}]\n\nThis target selector can be used in an execute command to run a command as the entity. Try putting this in your loop.mcfunction:\nexecute as @e[type=arrow,nbt={inGround:1b}] at @s run say I'm an arrow, I'm in the ground!\nReload your datapack and fire an arrow at at a block. You should see that your chat is spammed with messages, meaning that we successfully selected arrows in the ground, and executed a command as them!\n\nMake it go boom!\nNow we can move onto the fun part! We have a simple command which will run another command as any arrow in the ground. We only need to do two things with this command:\nSpawn an explosion at the position of the arrow\nKill the arrow so that it only explodes once\n\nTo create an explosion in Minecraft, we can simply summon a TNT entity. When a TNT entity is summoned, it will explode instantly.\nexecute as @e[type=arrow,nbt={inGround:1b}] at @s run summon tnt\n\nThen, we just need to copy this command and make it kill the arrow after the explosion has happened. This is as simple as it sounds - we can use /kill to remove the arrow. Your finished loop.mcfunction should look like this:\nexecute as @e[type=arrow,nbt={inGround:1b}] at @s run summon tnt\nkill @e[type=arrow,nbt={inGround:1b}]\n\n:::info\nIn reality, this method isn't the best one to use. Instead of having two commands for this, you can just execute a function as the arrow which will summon the TNT at @s's position, and then kill @s. By only using the @e selector once and then referring to @s, you remove extra stress from the computer. For now, it doesn't matter - this guide is designed to give you a better idea of the logic rather than the little details:::\n\nYou're done! Once you /reload your pack, you should be free to play around with a simple exploding arrows datapack which you made with the help of this tutorial. Take a break to play around with it - you deserve one!\n\nAnd when you want to move on to other datpack ideas you might have, feel free to join our Discord server for extra support from our team of helpers. We're more than happy to help you on your journey to creating awesome Minecraft datapacks!\n\n","tags":[],"versions":"latest","url":"/guide/getting-started/"},{"title":"Player ID System","content":"\r\nThis page is validated and up to date with Minecraft Java: 1.21\n\nGive each player a unique ID\nCreate a scoreboard in a load function that runs on /reload\nnamespace:load\nscoreboard objectives add playerid dummy\nCreate a function to assign a unique id to the player\nnamespace:assign_id\nscoreboard players add .global playerid 1\nscoreboard players operation @s playerid = .global playerid\nCreate a tick advancement to assign an id to a player when they first join\n{\n  \"criteria\": { \"requirement\": { \"trigger\": \"minecraft:tick\" }},\n  \"rewards\": { \"function\": \"namespace:assign_id\" }\n}\nCheck if an entity has the same ID as the player\nCreate a predicate that compares the id\n\n&gt; namespace:match_id\n{ \"condition\": \"minecraft:entity_scores\", \"entity\": \"this\", \"scores\": {\n  \"playerid\": {\n    \"min\": { \"type\": \"minecraft:score\", \"target\": { \"type\": \"minecraft:fixed\", \"name\": \"#this\" }, \"score\": \"playerid\" },\n    \"max\": { \"type\": \"minecraft:score\", \"target\": { \"type\": \"minecraft:fixed\", \"name\": \"#this\" }, \"score\": \"playerid\" }\n  }}\n}\nTo use it in a function, you can do that following\nscoreboard players operation #this playerid = @s playerid\nsay @e[predicate=namespace:match_id] HAVE THE SAME PLAYERID\n","tags":[],"versions":"latest","url":"/guide/technical/player-id-system/"},{"title":"Raycasts","content":"\nRaycasting\n\nRaycasting is when we shoot a line from the player's eyes in the direction they are looking. We use this to get what the player is looking at, and do something to it, such as spawning an explosion.\n\n:::Info\nThis tutorial uses a neat thing called a recursive function. A recursive function is a function which runs itself over and over again.\n:::\n\nRaycast to an entity\n\nThis method will show you how to find what entity that a player is looking at. This is useful for many reasons - if you wanted to make a gun datapack, you'd need to damage the entity that a player is looking at in order to damage them.\n\nTo do this, you have to run a recursive function which will start at the eyes of the player and keep running itself 0.1 blocks forward until it hits an entity. When it does hit an entity, you can easily get the entity and do something to it.\n\nFirstly, we'll make the function which, when you run it, will start the raycast. In this function, we'll want to:\n\nset the maximum distance for the raycast, so it won't go on forever if it never hits an entity.\nrun the function at the eyes of the player\n\nTo set a maximum distance, we store the maximum amount of times we want the function to run in a scoreboard. Every time the recursive function runs, we want to subtract one from that scoreboard, and only continue if the score is more than 0.\n\nFirst, you need to create a scoreboard in your load function.\nnamespace:load\n\nscoreboard objectives add temp dummy\n\nThen, we can use this scoreboard to set the limit of the raycast before we run it (In this case weset it to 1000 which is 100 blocks. 1000 steps * 0.1 blocks/setp = 100 blocks).\n\nWe also tag the entity executing the raycast so we can exclude it later for the hit detection.\n\nCall The raycats function one step further in the facing direction.\n\nRemove the tag at the end of the function so it does not interfer with other racasts thhat might be executed within the same tick.\nnamespace:init\n\ntag @s add raycaster\n\nscoreboard players set raycastLimit temp 1000\n\nexecute at @s anchored eyes positioned ^ ^ ^.1 run function :raycast\n\ntag @s remove raycaster\n\nIn the raycast function, we want to check if the function has hit an entity, and if not, run it again until it does, hit a wall, or reaches the raycasts limt, moving a bit forward each time.\n\nWe first decrement the limit vale by 1.\n\nThen we make the path of the raycast visible by summoning a few particles. Instead of summoning particles, it could also run another function for more complex behaviour.\n\nThe next step is a bit more complex.\nWe execute a command as every entity that is not the caster and whose hitbox intersects with the two differebtky offset virtual volumes.\nNear the end you see unless function :hit this will run function as the hit entity and, because all functions without a return command return false and we check for unless, this condition resolves to true and will return with the number 0, ending the raycast.\nShould no entity be in both voluems and the  function doesn't get run, the return command at the end won't be reached and the raycast will continue.\n\nThe last command checks if the raycast hit a wall.\nIf it does, the raycast will end.\nIf it doesn't, it will then check if the limit is reached, again ending if it is.\nShould the limit not be reacched yet, it will move 0.1 block forward and call the raycast function again (regursion).\nnamespace:raycast\n\nscoreboard players remove raycastlimit temp 1\n\nparticle minecraft:flame\n\nexecute positioned -.99 -.99 -.99 as @e[dx=0,tag=!raycaster] positioned .99 .99 .99 as @s[dx=0] unless function :hit run return 0\n\nexecute if block   ~ #minecraft:replaceable if score raycastLimit temp matches 1.. positioned ^ ^ ^0.1 run function :raycast\n","tags":[],"versions":"latest","url":"/guide/technical/raycasts/"},{"title":"Slowcast","content":"\nSlowcasting\n\nA Slowcast is similar to a raycast, but unlike a standard Raycast, it is not instant.\n\nIn some cases it is enough to use a simple tp command that teleports a marker a bit forward every tick.\nIf you wanted it to move faster however, you have to increase the distance it telepots and this could result in skipping over entities or blocks you might want to detect.\n\nA slowcast solves this problem by teleporting multiple times within a single tick to travel fastre but still chekcing if it hits something on its way.\n\n:::info\nThis tutorial uses a thing called a recursive function. A recursive function is a function which runs itself over and over again.\n:::\n\nSlowcasting to an entity\n\nThis method shows you how you can create and shoot a slowcast to detect entities on its way.\n\nSlowcasts can be usefull if you want to create fast but not instantantaneous moving projectiles for magic spells for example.\n\nTo make a slowcast, you need:\nset up a projectile with all the data it needs\na duration function to manage the travel distance\na step function that teleports the projectile and checks if it hit something\na temporary loop that calls the step function for all active projectiles.\n\nLet's start by creating all the neccessary sccoreboards in the load function.\nnamespace:load\n\nscoreboard objectives add temp dummy\nscoreboard objectives add slowcast.steps dummy\nscoreboard objectives add slowcast.duration dummy\n\nNext step is to initialize the projectile. This is done by running the following function as and at the player.\nIt summons a new marker entity (any other entity works too) and runs the setup function as that entity.\nnamespace:init\n\nexecute anchored eyes positioned ^ ^ ^.3 summon minecraft:marker run function :setup\n\nSadly it is not possible to add nbt data in th esummon sub-command so we have to add it  in the setup function too.\nWe will give it a tag tgat marks it as a slowcast projectile.\nAfter that we set all the score it needs to function properly.\nIn this example you will see that instead of setting the scores directly it copies from temporary scoreboards.\nThis is so that the values are not hardccoded and can be different for different projectiles without having to create a new setup fucntion for each projectile. At the end we then call the temporary loop function.\nnamespace:setup\n\ntag @s add slowcast\n\nscoreboard players operation @s slowcast.steps = maxSteps temp\nscoreboard players operation @s slowcast.duration = duration temp\n\nfunction :temp_tick\n\nThe projectile is all set up and the loop function is called.\nThe loop function is the part of this whole system which keeps everything running as long as there are active slowcast projectiles.\nnamespace:temp_tick\n\nexecute as @e[type=marker,tag=slowcast,scores={slowcast.duration=1..}] at @s run function :duration\n\nexecute if entity @n[type=marker,tag=slowcast] run schedule function :temp_tick 1t\n\nNow the actual slowcast logic which handles the movement, travel distance, and hit detextion.\n\nIn the looping function the duration function is called, let's make this one first.\nThis function is responsible for the slowcasts travel distance and calling the step function for the actual movement.\ndecrement the duration score\nstores the projectiles step count in a temporary scoreboard\ncalls the step function 0.2 blocks further in the facing direction\nkill the projectile should it have a distance score of below 1 at the end of the function\nnamespace:duration\n\nscoreboard players remove @s slowcast.duration 1\n\nscoreboard players operation steps temp = @s slowcast.steps\nexecute positioned ^ ^ ^.1 run function :step\n\nexecute unless score @s slowcastDuration matches 1.. run kill\n\nIn the called step function we handle the teleportation betwen the current and target position and checking if the projectile has hit something on it's way there.\ndecrement the step score in the temporary scorebard (we still need the step score stored in the projectile for the next time we call the step fucntion)\nmake some particles for the visuals (you could replace the oarticle command with another function call that does more complex stuff)\nexecute a command as every entity (excluding entities with the slowcast tag and players) whose hitbox intersects with both virtual volumes run the hit function and kill the projectile.\ntp the projectile to the current position (until now it only executed the command at this position but is still 0.1 block further back)\nexecute this function again one 0.1 block step forward should the temporary step counter still be over 1 (recursion)\nnamespace:step\n\nscoreboard players remove steps temp 1\n\nparticle flame   ~ .1 .1 .1 0 1\n\nexecute as @e[type=!player,type=!marker,dx=0] positioned -.99 -.99 -.99 if entity @s[dx=0] positioned .99 .99 .99 unless function :hit run kill @n[tag=slowcast]\n\ntp   ~\n\nexecute if score slowcastSteps temp matches 1.. positioned ^ ^ ^.1 run function :step\n\nThe hit function called in the hit detection does whatever you want it to do when hitting an entity.\nIt could spawn an explosion, apply an effect, or simpoly deals some damage.\n:::Tip\nWhen you make the hit function have a successful return value, it will not kill the projectile in the step function. You could use this to make a piercing projectile for example.\n:::","tags":[],"versions":"latest","url":"/guide/technical/slowcasts/"},{"title":"Generating Random Numbers","content":"\r\nThis page is validated and up to date with Minecraft Java: 1.21\n\nGenerating a random number is very useful in programming for a variety of reasons, so lets lean how to do it with a datapack! The method for you will vary based on your datapack's Minecraft version, if you use 1.20.2+, it will be a bit easier, because of the acces to the random command.\n\n1.20.2+\n\nUse the /random command, TODO: put guide here.\n\n1.20.1 and below\n\nLets begin by creating a new file in data//loot_tables/. We will call it rng.json, with that done, lets put this inside:\n\n&gt; rng.json\n{\n  \"pools\": [\n    {\n      \"rolls\": {\n        \"min\": 1,\n        \"max\": 10\n      },\n      \"entries\": [\n        {\n          \"type\": \"minecraft:item\",\n          \"name\": \"minecraft:stone\",\n          \"functions\": [\n            {\n              \"function\": \"minecraft:set_count\",\n              \"count\": 0\n            }\n          ]\n        }\n      ]\n    }\n  ]\n}\n\nYou can change the values 1 and 10 to change the range. If you leave it as it is, it generates a random number between 1-10.\n\nSee it in action!\nTo use this, you will just have to store the result of summoning this loot table. So you can just do this:\nexecute store result . . . run loot spawn   ~ loot :rng\n\nThis will store the random number in wherever you specified (Can be a scoreboard, storage, ...).","tags":[],"versions":"latest","url":"/guide/technical/random-numbers/"},{"title":"Debugging your Datapacks","content":"Debugging your datapacks\n\nThere will come times when your datapack won't work, and you will have to figure out what exactly doesn't work in it. Don't worry if this happens to you, if you're like any of the rest of us, this will happen often. Code will almost never work the first time you try it. An error in your code is referred to as a bug. Removing these bugs is called debugging. This guide will teach you the best methods for debugging datapacks.\n\nWhat are bugs?\n\nBugs are a fancy programmer term for an error in your code. There are two main types of bugs:\n\nSyntax error**: This is a bug in the actual written code. This is caused by the code you write being incorrectly written so that the computer literally can't read it. For example, writing \"executr as @a\" would be a syntax error because \"executr\" isn't a command.\nLogic error**: This is a bug where the written code is correctly written, but the code doesn't do what you want it to. This is caused by a mistake in the code logic. In the simplest example, if you want to give a player 32 diamonds, but you accidentally wrote 322.\n\nFinding and debugging syntax errors\n\nSyntax errors are pretty easy to spot and fix, due to Minecraft's output logs, which literally tell you if your code is incorrect. When you're coding datapacks, its a good idea to always have the logs open if you need to double check it. You can open the logs by opening the default Minecarft launcher and clicking \"Settings\", and then enabling \"Open output log when Minecraft: Java Edition starts\", then just starting the game.\n\nA guide on how to open the Minecraft launchers output logs\n\nSyntax errors will show up in red text when you /reload your datapack. But sometimes other errors can also show in yellow text instead.\n\nLets take this image as an example:\nOutput log with an error.\nHere, the error tells you exactly where the error is - in this case it's in the function \"be:give\" at line 1 after \".... give @s\". And indeed I did spell \"loot\" as \"lot\", which caused the error.\nCode with a syntax error\n\nFinding logic errors\n\nLogic errors are more difficult to find because there's nothing actually incorrect with the code you wrote, it just does something other than what you want it to do.\n\nAn easy way to find where a logic error is in the code is to make use of the say or tellraw command. These commands will send any message to the chat, making it easy for you to know when and if your code actually runs as you expect it to. You can easily put a say Function  ran correctly command in your function - If the function runs, then it will send a message to the chat. It will also send the name of the entity that ran the function to the chat, so you can see if your function is executed by the correct entity.\n\nSimilarly, you can use the tellraw command for more advanced debugging. The tellraw command also has the capability to show you the value of scoreboards and NBT values, so you can check what data your code is using. For instance, if you want to check the value of a scoreboard, you could use the following command:\n\ntellraw @a {\"score\":{\"name\":\"@s\",\"objective\":\"some_scoreboard_objective\"}}\n\nBased on the output of these commands in chat, you can use this to tell where your code goes wrong. (Just make sure to remove them after you've found the error, otherwise it can get annoying).\n\nYou may want to keep the debug messages in the datapack, but you don't want it to be sent to every player. Fortunately for us, with the tellraw command, you can specify to who the message will be sent. This means you could only send the debug messages to those who have the tag debug:\ntellraw @a[tag=debug] {\"text\":\"Debug message sent only to people with the debug tag!\"}\n\nDebugging logic errors\n\nUnfortunately, debugging logic errors in your code isn't as easy as fixing one spelling mistake. But yet there are still techniques that we can use.\n\nOne way to solve logic errors is to recreate the error in a separate project. When you remove all the other context of the pack, you can focus just on the bit which doesn't work. You can just copy out the code you want to fix into a separate datapack, then fix it there. Once you've identified and fixed the problem, you'll know how to fix it in the real project.\n\nSummary\n\nThe first main method for debugging datapacks is using Minecrafts output logs, we've already learnt how to use those in the first part of this guide. The second method is using the in-game commands, like /say and /tellraw to print information in real-time about how your datapack works. But those are not the only ones, you can use the /scoreboard objectives setdisplay  command to show the values of a scoreboard on your screen in real-time, or you can use /data get ..., which will print the value of any NBT data in chat.\n\nA scoreboard on screen\n\nYou might also find that some other methods that suit you the best, for example you might find the Data Reload mod useful for displaying errors in chat, or a completely different method, that is up to you.","tags":[],"versions":"latest","url":"/guide/technical/debugging/"},{"title":"Adding Jukebox Songs","content":"\r\nThis page is validated and up to date with Minecraft Java: 1.21\n\nHow to add custom jukebox songs\nIn this guide, we will not only learn how to create custom jukebox songs, but also how to give yourself a custom music disc item and implement custom sounds!\n\nThis will only work in 1.21+, as custom enchantments were added in the snapshot 24w21a.\n:::info\nThis guide requires you to have atleast a small understanding of datapacks, if you don't understand this guide, you can read the Getting Started guide.\n:::\n\nSetting up the datapack\nTo start you will need a basic datapack, if you don't know how to make one, see the Getting Started guide.\n\nFirstly, we are going to create the actual jukebox song file in the directory data//jukebox_song/. The file can be named whatever, but it has to be in the .json file format. For the purposes of this tutorial, we're gonna call it example_jukebox_song.json. Inside, we will put and configure this:\n\n{\n    \"comparator_output\": 13,\n    \"description\": {\n        \"text\": \"ARTIST - SONG NAME\"\n    },\n    \"length_in_seconds\": 69.0,\n    \"sound_event\": {\n        \"sound_id\": \":\"\n    }\n}\n\nThis is a run-down of the fields in that file:\ncomparator_output: A value between 1 and 15, representing the redstone output when a comparator is placed next to the jukebox playing this song.\ndescription: The description of the enchantment (should be a JSON text component).\nlength_in_seconds: The length of the song (in seconds)\nsound_event: The ID of the sound (from the resourcepack) to play.\n\nIf you don't understand what to put in sound_event, dont worry, the next part is going to focus specifically on this!\n\nAdding custom music - Resourcepack\nThis part is going to be optional in the case, that you only want a vanila Minecraft sound to play from the jukebox. In that case, change the sound_id in the example_jukebox_song.json file from the datapack to the sounds ID. (for example: \"sound_id\": \"minecraft:music_disc.cat\").\n\nIf you don't want to use a default Minecarft sound, then a resource pack is required to add the custom sound (in this case, the music on the disc) to Minecraft, so that the datapack can read it.\n\n:::info\nMinecraft handles sound in .ogg files. There are many different converters you can use to convert an MP3, WAV, or other audio file to .ogg.\n:::\n\nYou need to add your .ogg file (the audio of your music disc) to assets/&lt;namespace&gt;/sounds/&lt;title&gt;.ogg. Make sure that &lt;namespace&gt; and &lt;title&gt; are the same values you put in the datapack's JSON file (the example_jukebox_song.json file in our case).\n\nThen, if you haven't already, you need to create a sounds.json file at the position assets/&lt;namespace&gt;/sounds.json. This file tells Minecraft what audio files map to what IDs. Put this inside:\n{\n    \"music_disc.&lt;title&gt;\": {\n        \"sounds\": [\n            {\n                \"name\": \"&lt;namespace&gt;:&lt;title&gt;\",\n                \"stream\": true\n            }\n        ]\n    }\n}\n\nSee it in action\nOnce you save the above files, you need to activate the resource pack, and reload it with the keybind F3 + T in-game. You will also need to leave and rejoin the world to update the datapack.\n\n:::warning\nFor this to work, you will need to leave and rejoin the world, just using the /reload command won't do the trick here!\n:::\n\nTo get the music disc, you need to get an item which has the minecraft:jukebox_playable component. This can be any item - it doesn't have to necessarily be an already existing music disc (but you can if you want)\ngive @s minecraft:YOUR_ITEM[minecraft:jukebox_playable={song:\"&lt;datapack namespace&gt;:example_jukebox_song\"}]\n\nThen, you can use this item on a jukebox, and it should start playing your song!","tags":[],"versions":"latest","url":"/guide/adding-new-features/jukebox-songs/"},{"title":"Recipes for your Custom Items","content":"\r\nThis page is validated and up to date with Minecraft Java: 1.21\n\nThere are two ways to add recipes to your custom items, they differentiate based on what Minecraft version you are developing for. The first one is for the Minecraft version 1.20.5+ (Datapack format 34+), here items can be directly specified in the output with item components. The second method is for all version before 1.20.5.\n\nAfter 1.20.5\nThis is the easier method of the two, only requiring you to put the item id and components into the recipe output.\n\n:::info\nNote that there is currently no way to specify item components in the recipe's input items, only in the result. Meaning you custom item can't (easily) be crafted out of different custom items.\n:::\n\nThe instructions here will be very simple, requiring you to only create one file, that being the actual crafting recipe file. This file can be named whatever, but has to end in the .json file format.\n\nHere is an example of a recipe with the output of a custom item:\n&gt; scuteaxe.json\n{\n  \"type\": \"minecraft:crafting_shaped\",\n  \"pattern\": [\n    \"ttt\",\n    \" s \",\n    \" s \"\n  ],\n  \"key\": {\n    \"t\": {\n      \"item\": \"minecraft:turtle_scute\"\n    },\n    \"s\": {\n      \"item\": \"minecraft:stick\"\n    }\n  },\n  \"result\": {\n    \"id\": \"minecraft:iron_pickaxe\",\n    \"count\": 1,\n    \"components\": {\n      \"minecraft:tool\": {\n        \"rules\": [\n          {\n            \"blocks\": \"minecraft:turtle_egg\",\n            \"speed\": 6,\n            \"correct_for_drops\": true\n          }\n        ],\n        \"default_mining_speed\": 3,\n        \"damage_per_block\": 1\n      },\n      \"minecraft:item_name\": \"\\\"{\\\\\\\"text\\\\\\\":\\\\\\\"sCUTE-axe\\\\\\\"}\\\"\"\n    }\n  }\n}\n\nIn the example, you can see that the result has a \"components\" field, where you can list the components that your custom item should have. I can also recommend a useful site for generating recipes with specified components: https://misode.github.io/recipe/\n\nBefore 1.20.5\n\nThis part of the guide assumes that you already knowledge some basic commands and how crafting recipes and advancements work.\n\nTo create a crafting recipe for one of your custom items, you need just a little bit more than for a normal recipe. This is because of the fact that you coudn't use NBT in recipes before 1.20.5 dropped, so thats why we need a small workaround.\n\nLets create the recipe first:\n\n&gt; scuteaxe.json\n{\n    \"type\": \"minecraft:crafting_shaped\",\n    \"pattern\": [\n        \"ttt\",\n        \" s \",\n        \" s \"\n    ],\n    \"key\": {\n        \"t\": {\n            \"item\": \"minecraft:turtle_scute\"\n        },\n        \"s\": {\n            \"item\": \"minecraft:stick\"\n        }\n    },\n    \"result\": {\n        \"item\": \"minecraft:knowledge_book\"\n    }\n}\n\nAs mentioned before, we can't use the custom item as output, so we use the knowledge book as a placeholder.\n\nTo switch the knowledge book with our custom item, we need an advancement to react when we craft the recipe. For this we use the recipe_crafted trigger.\nWith some trickery, here it is also possible to make the ingredients require certain nbt.\n\n&gt; craft_scuteaxe.json\n{\n    \"criteria\": {\n        \"requirement\": {\n            \"trigger\": \"minecraft:recipe_crafted\",\n            \"conditions\": {\n                \"recipe_id\": \":scuteaxe\"\n            }\n        }\n    },\n    \"rewards\": {\n        \"function\": \":craft_scuteaxe\"\n    }\n}\n\nLasty we have to make the actual function that handles the item switching.\nYou can either use a give command or, what I recommend more, define the item in a separate loot table and then use the loot command.\n\n&gt; craft_scuteaxe.mcfunction\nclear @s knowledge_book\nadvancement revoke @s only :craft_scuteaxe\nAny code can go here, this will run when the player crafts the item.\nloot give @s loot :\nYou can also you a give command here instead\n\n:::tip\nIf you want to create more recipes, you can just copy, rename and configure all the files we've just created.\n:::\n\nAnd that's it, you should now have a custom working recipe for your item.","tags":[],"versions":"latest","url":"/guide/adding-new-features/crafting-custom-items/"},{"title":"Installing a Datapack","content":"\nIntroduction\n\nSo you've found a nice datapack for Minecraft, and the next step is to get it into your game. This guide will explain how to install a datapack onto a world which exists, a new world.\n\nInstalling a datapack to an existing world\n\nIn your world menu, find the world which you want to install the datapack on. Click Edit.\n   The singleplayer menu\nOpen the world folder.\n   The edit menu\nIn the world folder, open the datapacks folder.\n   World folder with datapacks highlighted\nPut the datapack zip file into the folder.\n   zip folder in datapacks folder\nIf the zip folder contains a folder which contains data and pack.mcmeta, then put that folder in the datapacks folder instead of the full zip. Putting the zip in the datapacks folder only works when data and pack.mcmeta are directly in the root folder of the zip.\nRejoin the world and run /reload.\n   Reload command in chat\n\nInstalling a datapack to an new world\n\nGo to the Create New World screen. Make sure that you enable cheats.\n   Create new world screen\nNavigate to the Data Packs screen. This is under the \"More\" tab in the latest versions.\n   The Data Packs screen option\nDrag and drop the datapack zip into this screen.\n   The Data Packs screen after I dragged and dropped something in\nIf it doesn't show up, then it's likely that the zip file contains a folder which contains the datapack, and not the zip file just containing the datapack. You need to take the folder out of the datapack, and put it in the datapacks folder (click the \"Open Packs Folder\" button to open it.)\nClick on the datapack icon to apply it to the world\n   The Data Packs screen after I clicked the icon\nCreate the world, and then run /reload in chat.\n   Reload command in chat\n\nInstalling a datapack to a realm\n\nTo install a datapack to a realm, you need to basically do this:\n\nDownload the world from the realm into your singleplayer worlds.\nFollow the steps in \"Installing a datapack to an existing world\" to install a datapack on that world\nUpload that world to your realm.\n","tags":[],"versions":"latest","url":"/guide/installing-a-datapack/"},{"title":"Site Development","content":"\nSite Meta and Contribution\nThis page is meant to be an introduction for contributors to the wiki. In it is multiple examples which you can examine raw in the site source code.\n\nContributing\nThe full contributing guide is available on a separate page here.\n\nTo contribute, please fork the Datapack-Hub/wiki repo on GitHub, make changes in your fork, then submit a pull request, explaining your changes.\n\nFormatting\nThis section goes over how to format wiki pages. We like consistency, so please read carefully and use these features to your advantage:\nBasic formatting\n\nAll content on the website (other than navbar, sidebar and things that are not the actual wiki pages) are made using a technology called mdsvex. This technology enables people like you to insert markdown with svelte components.\n\nEach page is made of 3 parts:\n\nfront matter (metadata about the page such as title)\ncontent (the actual content of the page)\ncomponents (custom components that allow for interactivity or other features not able to be reproduced with markdown)\n\nEach is crucial to making the page look and feel how it does.\n\nFormatting Examples\n\n\n\nExample Markdown used on the wiki:\nHeading 1\nParagraph text under heading 1\n\nHeading 2\nParagraph text under heading 2\n\nHeading 3\nParagraph text under heading 3\n\nClick the link to go to the main page\n\nI have some inline code for you. Here's some more:\n\n\\{\n    \"this.is\":\"cool!\"\n}\n\\\nList Item\nAnother List Item\n\nFirst List Item\nSecond List Item\n\n| Which page? | How much I hate formatting it? |\n|---|---|\n| This one | Very much |\n| Other ones | Not as much |\n\nCustom Elements\n:::info\nI am a very important piece of information. In this box, you might find educational info, or explanations for features.:::\n\n:::warning\nThe stuff in this box is probably very important. You should read this box - it might contain information which affects your datapack.:::\n\n:::tip\nYou can do this really cool thing. It'll make your life a lot easier! But don't worry - it's only optional.:::\n\nThis page is validated and up to date with Minecraft Java: 1.21\n\n\n\nResult of the markdown:\n\nHeading 1\nParagraph text under heading 1\n\nHeading 2\nParagraph text under heading 2\n\nHeading 3\nParagraph text under heading 3\n\nClick the link to go to the main page\n\nI have some inline code for you. Here's some more:\n\n{\n    \"this.is\":\"cool!\"\n}\n\nList Item\nAnother List Item\n\nFirst List Item\nSecond List Item\n\n| Which page? | How much I hate formatting it? |\n|---|---|\n| This one | Very much |\n| Other ones | Not as much |\n\nCustom Elements\n:::info\nI am a very important piece of information. In this box, you might find educational info, or explanations for features.:::\n\n:::warning\nThe stuff in this box is probably very important. You should read this box - it might contain information which affects your datapack.:::\n\n:::tip\nYou can do this really cool thing. It'll make your life a lot easier! But don't worry - it's only optional.:::\n\nThis page is validated and up to date with Minecraft Java: 1.21\n\n\n","tags":[],"versions":"latest","url":"/contribute/"},{"title":"Resources","content":"\nResources\nListed here are links to credible and reliable places to aid in command support and creation.\n\nDatapack Hub\nDiscord\n\nMCStacker\nWebsite\nDiscord\n\nData Pack Generators\nWebsite\n\n","tags":[],"versions":"latest","url":"/resources/"},{"title":"Credits","content":"\nCredits\nThe Datapack Wiki is managed by Datapack Hub, based on an original design and idea by Aandeel. All of the content on this wiki is made possible thanks to the dedication of our awesome contributors! You can contribute to this wiki on our GitHub - click the Edit button on any page.\n\nAdministrators\nThese people run and develop the site, making any and all important decisions.\nSilabear\nCobblestone\nAandeel\n\nEditors\nThese people are in charge of what contributions are added to the site, as well as planning and writing new pages.\nGears\n\nContributors\nThese people have written or edited pages for the wiki or guides.\nDiamond\nHeDeAn\n\n:::note\nIf you're contributing, feel free to add your username to this page! You can contribute by clicking the Edit button on any page.\n:::","tags":[],"versions":"latest","url":"/credits/"}]